prog_praxis/hyper_loglog/loglog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LOGLOG</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="LOGLOG"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-25T17:56-0500"/>
<meta name="author" content="Graham Enos"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>


<div id="content">
<h1 class="title">LOGLOG</h1>

<p>In <a href="http://algo.inria.fr/flajolet/Publications/DuFl03.pdf">this</a> paper, Marianne Durand and the late Phillipe Flajolet
describe an interesting algorithm that estimates the cardinality of
a large multiset&mdash;think the number of unique words in a
file&mdash;while using only a small amount of auxiliary memory to get
the job done. That is, an exact answer is easy to obtain
programmatically (use your favorite language's hashtable or set
making utilities, for instance), but if the multiset is large enough
the amount of memory required to store all the unique items may be
prohibitively large. Durand and Flajolet's technique uses much less
memory but provides an estimate instead of an exact answer, trading
off memory for precision.
</p>
<p>
The paper presupposes the existence of two functions:
</p><ul>
<li>a hash function h that maps elements from the domain of the multiset to
  bitstrings
</li>
<li>a function &rho; that returns the rank of the first 1-bit from the
  left in a given bitstring; i.e. &rho;(1&hellip;) = 0, &rho;(001&hellip;) = 2,
  etc.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</li>
</ul>


<p>
Here is the basic algorithm from Durand &amp; Flajolet to estimate the
cardinality of a multiset <code>MS</code>.<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup> First, set m = 2<sup>k</sup> for some
bitsize k. Then,
</p>


<pre class="example">init array M[0:m-1] ← 0
for x = b_0,b_1... in MS:
    j ← int(b_0,b_1,...,b_{k-1})            // integer from the top k bits
    M[j] ← max(M[j], ρ(b_k,b_{k + 1},...))
return E = α_m * m * 2^(1 / m * sum(M))
</pre>

<p>
where &alpha;<sub>m</sub> is given by
\[ \left( \Gamma(-1/m) \frac{2^{1/m} - 1}{\ln 2} \right)^{-m} \]
and is used to "precisely correct the systematic bias in the
asymptotic limit."
</p>
<p>
This algorithm uses the hash function to map each element of <code>MS</code> to
an integer. From there, it uses the bit patterns of these elements to
sort each element into a bin in our array <code>M</code>. The idea is that the
top bits determine which bin to insert into, while the bottom bits
give the value to put into that bin. Rather than keep all of the
possible values a bin might receive, however, we only keep the
maximum; this gives a probabilistic measure of the number of items
inserted into any one bin.
</p>
<p>
Your task is to write an implementation of the LogLog algorithm
given above. When you are finished, you are welcome to read or run a
suggested solution, or to post your own solution or discuss the
exercise in the comments below.
</p>
<p>
<b>Page 2</b>
</p>
<p>
We'll write a straightforward Python (3.x series) implementation and
run it against the typical *nix installation's <code>/usr/share/dict/words</code>
as a benchmark.
</p>
<p>
We'll first begin with the auxiliary functions <code>alpha</code> and <code>rho</code>:
</p>


<pre class="example">from math import gamma, log
k = 16

def alpha(m):
    return pow(gamma(-1 / m) * (pow(2, 1 / m) - 1) / log(2), -m)

def rho(n):
    for i in range(k):
        if (n &amp; (1 &lt;&lt; (k - i))) != 0:
            return i
    return k
</pre>

<p>
The first function is just a straight translation of the math
version given in the paper, while <code>rho()</code> starts at the left-most
bit of its input and stops when it finds a one.
</p>
<p>
We also need a hash function; we'll use one built into Python,
modifying its output to return a 32 bit unsigned integer, but you can
just as easily use the hash function given in a <a href="http://programmingpraxis.com/2013/06/07/sets/">previous</a> exercise.
</p>



<pre class="example">def h(x):
    return hash(x) % (1 &lt;&lt; 32)
</pre>


<p>
Now that that's taken care of, we can write our <code>loglog</code> function:
</p>



<pre class="example">def loglog(MS):
    m = 1 &lt;&lt; k
    M = [0] * m
    for x in MS:
        i, j = divmod(h(x), m)
        M[j] = max(M[j], rho(i))
    return alpha(m) * m * pow(2, sum(M) / m)
</pre>


<p>
Here is our translation of the algorithm into code. We first set <code>m</code>
to be 2<sup>k</sup> and initialize our list <code>M</code> of zeros. Next, we walk through
our multiset. For each element therein, we use the top k bits to index
into our list <code>M</code>, and then set that value to the maximum of the
bottom k bits and the current value. Finally, we return our adjusted
estimate based on the sum of the values in <code>M</code>.
</p>
<p>
Here's our Python code to call this with the big text file:
</p>


<pre class="example">if __name__ == '__main__':
    with open('/usr/share/dict/words') as f:
        MS = [line.strip() for line in f]
    print(loglog(MS))
</pre>

<p>
Here are the results:
</p>


<pre class="example">$ python3 loglog.py
484992.2652755824
</pre>

<p>
Compare that to the result of running <code>wc</code> on the file (the main
reason we chose this as a test was that the number of words in the
file is small enough to count another way):
</p>


<pre class="example">$ wc -l /usr/share/dict/words
  479829
</pre>

<p>
Our LogLog estimate is just over 10% off of the actual; not bad,
considering that it will scale to larger datasets much more
effectively than the naive approach.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> Note that we begin counting from zero instead of 1; this is one
of the only things we'll do differently than the original paper.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> The name of our multiset is the only other place we differ from
the original paper.
</p>



</div>
</div>
</div>

</body>
</html>
